In [1]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn
np.random.seed(101)

In [4]:
df = pd.DataFrame(np.random.randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
bol = df >  0

In [8]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [14]:
bol = df['W'] > 0
df2 = df[bol]
df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [17]:
df[(df['W'] > 0) & (df['Y'] > 1)] # operador and( e )

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df[(df['W'] > 0) | (df['Y'] > 1)] # Operador or( ou )

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df.reset_index(inplace=True)

In [23]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [27]:
col = 'RS RJ SP AM SE'.split()

In [28]:
col

['RS', 'RJ', 'SP', 'AM', 'SE']

In [29]:
df['Estados'] = col

In [30]:
df

  index         W         X         Y         Z Estados
0     A  2.706850  0.628133  0.907969  0.503826      RS
1     B  0.651118 -0.319318 -0.848077  0.605965      RJ
2     C -2.018168  0.740122  0.528813 -0.589001      SP
3     D  0.188695 -0.758872 -0.933237  0.955057      AM
4     E  0.190794  1.978757  2.605967  0.683509      SE

In [31]:
df.set_index('Estados')

        index         W         X         Y         Z
Estados
RS          A  2.706850  0.628133  0.907969  0.503826
RJ          B  0.651118 -0.319318 -0.848077  0.605965
SP          C -2.018168  0.740122  0.528813 -0.589001
AM          D  0.188695 -0.758872 -0.933237  0.955057
SE          E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.set_index('Estados', inplace=True)

In [33]:
df

        index         W         X         Y         Z
Estados
RS          A  2.706850  0.628133  0.907969  0.503826
RJ          B  0.651118 -0.319318 -0.848077  0.605965
SP          C -2.018168  0.740122  0.528813 -0.589001
AM          D  0.188695 -0.758872 -0.933237  0.955057
SE          E  0.190794  1.978757  2.605967  0.683509

In [34]:
df['Ano'] = [2020, 2021, 2019, 2018, 2017]

In [35]:
df

        index         W         X         Y         Z   Ano
Estados
RS          A  2.706850  0.628133  0.907969  0.503826  2020
RJ          B  0.651118 -0.319318 -0.848077  0.605965  2021
SP          C -2.018168  0.740122  0.528813 -0.589001  2019
AM          D  0.188695 -0.758872 -0.933237  0.955057  2018
SE          E  0.190794  1.978757  2.605967  0.683509  2017

In [36]:
df['Desc_estados'] = ['Rio grande do sul', 'Rio de Janeiro', 'São paulo', 'Amazonas', 'Seara']

In [37]:
df

        index         W         X         Y         Z   Ano       Desc_estados
Estados
RS          A  2.706850  0.628133  0.907969  0.503826  2020  Rio grande do sul
RJ          B  0.651118 -0.319318 -0.848077  0.605965  2021     Rio de Janeiro
SP          C -2.018168  0.740122  0.528813 -0.589001  2019          São paulo
AM          D  0.188695 -0.758872 -0.933237  0.955057  2018           Amazonas
SE          E  0.190794  1.978757  2.605967  0.683509  2017              Seara

In [38]:
df['Ano']

Estados
RS    2020
RJ    2021
SP    2019
AM    2018
SE    2017
Name: Ano, dtype: int64

In [39]:
df['Desc_estados']

Estados
RS    Rio grande do sul
RJ       Rio de Janeiro
SP            São paulo
AM             Amazonas
SE                Seara
Name: Desc_estados, dtype: object

In [40]:
pd.Categorical

pandas.core.arrays.categorical.Categorical

In [41]:
pd.Categorical(df)

['index', 'W', 'X', 'Y', 'Z', 'Ano', 'Desc_estados']
Categories (7, object): ['Ano', 'Desc_estados', 'W', 'X', 'Y', 'Z', 'index']

In [42]:
pd.DataFrame(df)

        index         W         X         Y         Z   Ano       Desc_estados
Estados
RS          A  2.706850  0.628133  0.907969  0.503826  2020  Rio grande do sul
RJ          B  0.651118 -0.319318 -0.848077  0.605965  2021     Rio de Janeiro
SP          C -2.018168  0.740122  0.528813 -0.589001  2019          São paulo
AM          D  0.188695 -0.758872 -0.933237  0.955057  2018           Amazonas
SE          E  0.190794  1.978757  2.605967  0.683509  2017              Seara